app/controllers/v1/contacts_controller.rb

  def create
    @contact = Contact.new(contact_params)

    @contact.save!
---
INSERT INTO "contacts" ("first_name", "last_name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["first_name", "Ivan"], ["last_name", "Derlich"], ["email", "ivanderlich@gmail.com"], ["created_at", "2021-03-30 02:16:16.860833"], ["updated_at", "2021-03-30 02:16:16.860833"]]

  def update
    @contact = Contact.find(params[:id])
    if @contact.update(contact_params)
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "contacts" SET "last_name" = $1, "updated_at" = $2 WHERE "contacts"."id" = $3  [["last_name", "DePineda"], ["updated_at", "2021-03-31 02:17:12.579170"], ["id", 4]]

  def destroy
    @contact = Contact.where(id: params[:id]).first
    if @contact.destroy
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 ORDER BY "contacts"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "contacts" WHERE "contacts"."id" = $1  [["id", 1]]