app/controllers/bookings_controller.rb

  def set_court_booking
    @booking = @court.bookings.find_by!(id: params[:id]) if @court
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]