app/controllers/bookings_controller.rb

  def create

    court = Court.find(params[:booking][:courtId])

    booking = Booking.create(
      booker_id: current_api_v1_user.id,
      court: court,
      date: params[:booking][:date],
      description: params[:booking][:description],
    )

    if booking.save
---
SELECT "courts".* FROM "courts" WHERE "courts"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
INSERT INTO "bookings" ("booker_id", "court_id", "date", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["booker_id", 1], ["court_id", 11], ["date", "2021-06-19 08:00:00"], ["description", "adsfasdfadsf"], ["created_at", "2021-06-20 05:51:36.183413"], ["updated_at", "2021-06-20 05:51:36.183413"]]
INSERT INTO "bookings" ("booker_id", "court_id", "date", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["booker_id", 1], ["court_id", 8], ["date", "2021-06-19 08:00:00"], ["description", ""], ["created_at", "2021-06-19 07:54:02.175012"], ["updated_at", "2021-06-19 07:54:02.175012"]]

  def destroy
    @booking.destroy
---
DELETE FROM "bookings" WHERE "bookings"."id" = $1  [["id", 17]]

  def on_mine
    bookings = Booking
      .joins(:booker)
      .joins(:court)
      .select(
        # bookings
        'bookings.id',
        'date',
        'bookings.description as booking_description',
        # courts
        'courts.id as court_id',
        'courts.name as court_name',
        # bookers
        'booker_id', # key from bookings
        'users.first_name',
        'users.last_name',
      )
      .where(courts: {administrator_id: @user.id})
---
SELECT "bookings"."id", "bookings"."date", bookings.description as booking_description, courts.id as court_id, courts.name as court_name, "bookings"."booker_id", "users"."first_name", "users"."last_name" FROM "bookings" INNER JOIN "users" ON "users"."id" = "bookings"."booker_id" INNER JOIN "courts" ON "courts"."id" = "bookings"."court_id" WHERE "courts"."administrator_id" = $1  [["administrator_id", 1]]

  def on_others
    bookings = Booking
      .joins(:court)
      .select(
        # bookings
        'bookings.id',
        'bookings.date',
        'bookings.description',
        # courts
        'courts.id as court_id',
        'courts.name as courts_name'
      )
      .where(booker_id: @user.id)
---
SELECT "bookings"."id", "bookings"."date", "bookings"."description", courts.id as court_id, courts.name as courts_name FROM "bookings" INNER JOIN "courts" ON "courts"."id" = "bookings"."court_id" WHERE "bookings"."booker_id" = $1  [["booker_id", 1]]

  def set_court
    @court = Court.find(params[:court_id])
---
SELECT "courts".* FROM "courts" WHERE "courts"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]

  def set_user
    @user = User.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "ivan@ivan.com"], ["LIMIT", 1]]

  def set_court_booking
    @booking = @court.bookings.find_by!(id: params[:id]) if @court
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]