app/controllers/courts_controller.rb

SELECT "courts".* FROM "courts"
---
  def index
    json_response(Court.all)