app/controllers/courts_controller.rb

  def index
    courts = Court
      .select('courts.id, courts.name, address, description, users.first_name, users.last_name')
      .joins('INNER JOIN users ON users.id = courts.administrator_id')
---
SELECT courts.id, courts.name, address, description, users.first_name, users.last_name FROM "courts" INNER JOIN users ON users.id = courts.administrator_id

  def create
    @court = Court.create!(court_params.merge({administrator_id: current_api_v1_user.id}))
---
INSERT INTO "courts" ("name", "address", "description", "administrator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "asdfas"], ["address", "asdfasdf"], ["description", "asdfasdf"], ["administrator_id", 1], ["created_at", "2021-06-16 03:20:05.532529"], ["updated_at", "2021-06-16 03:20:05.532529"]]

  def update
    if @court.update(court_params.merge({administrator_id: current_api_v1_user.id}))
      @court.save
---
INSERT INTO "courts" ("name", "address", "description", "administrator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def destroy
    @court.destroy
---
DELETE FROM "courts" WHERE "courts"."id" = $1  [["id", 2]]

  def set_court
    return head :unprocessable_entity unless _has_value? params[:id]

    @court = Court.find(params[:id])
---
SELECT "courts".* FROM "courts" WHERE "courts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]