app/controllers/users_controller.rb

  def set_user
    @user = User.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "ivan@ivan.com"], ["LIMIT", 1]]