app/controllers/users_controller.rb

  def set_user
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."uid" = $1 LIMIT $2  [["uid", "ivan@ivan.com"], ["LIMIT", 1]]